"use strict";

function randomHomeInfo() {
    let zh = [
        "雪崩的时候，没有一片雪花是不崩的",
        "如果不出意外的话应该是出意外了",
        "情况嘛就是这么个情况，具体什么情况还得看情况",
        "我之前还没发现，当我发现的时候我已经发现了",
        "听了你的分析，我决定自己再分析分析",
        "我前脚刚走，后脚就跟上了",
        "台上一分钟，台下六十秒",
        "现在的年轻人啊，和老一辈比起来真的年轻",
        "吃饱了就不饿了",
        "睡觉的时候一定要闭上眼，不然会睡不着",
        "我上次这么无语的时候还是在上次",
        "这么晚还没睡的人应该还没睡吧",
        "这句子挺短的，就是有点长",
        "回想起昨天，仿佛在昨天",
        "七日不见，如隔一周",
        "我长话短说，但是说来话长",
        "年轻人不要太年轻",
        "人在绷不住的时候，是绷不住的",
        "我曾在极度愤怒的时候极度愤怒",
        "但凡你这话有点道理 ，也不至于一点道理没有",
        "但凡你这话说的沾边点，也不至于一点不沾边",
        "关于明天的事后天就知道了",
        "据我所知我一无所知",
        "早餐不要空腹吃哦",
        "早餐记得空腹吃哦",
        "中国有句古话叫做有句古话说得好",
        "每次我不知道说什么的时候我就不知道说什么",
        "在令人失望这件事情上从来不让人失望",
        "如果我没猜错的话，那我一定是猜对了",
        "能力越大，能力就越大",
        "恭喜你被我恭喜了！",
        "上次见面的时候还是在上次",
        "这白开水怎么没味儿啊",
        "如果你和大多数人一样的话，那么和大多数人一样，你不知道自己和大多数人一样",
        "你会发现这里除了废话还是废话",
    ];
    let en = [
        "Morning.",
    ]

    let infos = zh;
    const pathname = window.location.pathname;
    if (pathname.startsWith("/en/")) {
        infos = en;
    }
    return infos[Math.floor(Math.random() * infos.length)];
}

(() => {
    let s = document.getElementById("random-home-info");
    if (!s) {
        return;
    }
    s.textContent = randomHomeInfo();
})();
